In [1]:
import pandas as pd

In [60]:
%ls /home/valldabo/Downloads/travdata/

agare.txt       horse.txt      notering.txt  rssum.txt      uppehall.txt
age.txt         kommentar.txt  odds.txt      shhuv.txt      utd.txt
ban.txt         kommreg.txt    omrspar.txt   shsum.txt      utlmtid.txt
berakdatum.txt  kommstat.txt   omr.txt       sparklass.txt  varkollhuv.txt
color.txt       kup.txt        parm.txt      spar.txt       varkolltmp.txt
ekvgrp.txt      kuskban.txt    pris.txt      spelutv.txt    varkoll.txt
galopp.txt      kusk.txt       prog.txt      tranare.txt    vpla.txt
garanti.txt     lopp.txt       raka.txt      tvldag.txt     winp2huv.txt
grafgrp.txt     mlrrad.txt     redu.txt      tvlkva.txt     Winp2.txt
grafrad.txt     mlr.txt        rshuv.txt     tvlsum.txt
hingst.txt      mtid.txt       rsreg.txt     tvl.txt

In [57]:
age = pd.read_csv('/home/valldabo/Downloads/travdata/age.txt', header=None, sep='\t', nrows=100, encoding='latin-1')
age.columns = ['sex', 'age', 'segrar', 'starter', 'proc']
age.head()

  sex  age  segrar  starter  proc
0   H    2     426     2547    16
1   H    3    4238    24084    17
2   H    4    5569    30544    18
3   H    5    4350    26221    16
4   H    6    2736    19866    13

In [59]:
agare = pd.read_csv('/home/valldabo/Downloads/travdata/agare.txt', header=None, sep='\t', nrows=100, encoding='latin-1')
agare.columns = ['id', 'name', 'segrar', 'starter', 'proc']
agare.head()

   id                         name  segrar  starter  proc
0   1        Sundberg Maria, Boden       0        0     0
1   2      Stall Shooter HB, Solna       2       27     7
2   3             Stall Frisk Luft       0        0     0
3   4        Remmen HB, Skellefteå       2       47     4
4   5  St Asagården HB o Tumult HB       0        2     0

In [65]:
ban = pd.read_csv('/home/valldabo/Downloads/travdata/ban.txt', header=None, sep='\t', nrows=100, encoding='latin-1')
ban = ban[ban.columns[0:7]]
ban.columns = ['id', 'bankod', 'bana', 'avstand', 'segrar', 'starter', 'proc']
ban.head()

   id bankod       bana avstand  segrar  starter  proc
0   3     AR     Arvika      50     126     2227     5
1   5     AX   Axevalla      44    2200    23267     9
2   6      B  Bergsåker      92    4417    45665     9
3   9     BJ     Bjerke     100    1027     9989    10
4  11     BL  Blommeröd      40      24      199    12

In [66]:
lopp = pd.read_csv('/home/valldabo/Downloads/travdata/lopp.txt', header=None, sep='\t', nrows=100, encoding='latin-1')

lopp.columns = ['id', 'horseid', 'datum', 'bana', 'lopp', 'spar', 'distans', 'tillagg', 'placering', 'tid', 'odds', 'kusk', 'verklspar']
lopp.head()

,id,horseid,datum,bana,lopp,spar,distans,tillagg,placering,tid,odds,kusk,verklspar
0,1355776,46278,2009-01-09,B,10,6,M,0,6,200a,625,Sko Hå,6
1,1356901,591,2009-01-22,G,8,7,L,1,0,179,651,Red Da,7
2,1355774,51169,2009-01-09,B,2,11,M,0,3,190,100,Hol PÅ,11
3,1356818,39640,2009-01-08,Ö,4,5,K,0,6,174a,37,Kon Jo,5
4,1355772,51743,2009-01-09,B,2,2,M,0,0,200,80,Wal Kr,2